[
  {
    "doc_id": "Ajay CK _Virtual Try On Contract.pdf",
    "chunk_text": " \n \n \n \nFREELANCE CONTRACT AGREEMENT \nThis Freelance Contract Agreement (\"Agreement\") is made and entered into on this 21st  day of May, 2025, by and \nbetween: \nSwakriti Lifestyle Private Limited, a company registered under the Companies Act, 2013, having its registered \noffice at Hill View, SP11/75/2, Pananvila Road, Powdikonam, Trivandrum, Kerala, India, and CIN: \nU47990KL2025PTC092291 (hereinafter referred to as the \"Company\"), and \nAjay C K, an independent contractor or entity with an address at Chakkum kulangara, Muttanur (po), \nMangalam, Tirur, Malappuram, Kerala 676561 \n1. Scope of Work \nThe Freelancer agrees to develop and deliver a deployable solution for a Virtual Try-On solution for the \nCompany. The solution must demonstrate the core functionality, including: \n• \nCreating a digital twin of the user using body measurements, profile image and full body image. \n• \nAble to accept outfit images via an API. Overlaying outfit images (front and side views) onto user images \n(face a",
    "chunk_index": 0,
    "page": 1,
    "label": "1"
  },
  {
    "doc_id": "Ajay CK _Virtual Try On Contract.pdf",
    "chunk_text": " outfit images via an API. Overlaying outfit images (front and side views) onto user images \n(face and full body). \n• \nGenerating a simulated 360-degree view of the user wearing the outfit. \n• \nAutomatically applying a default bottom wear when only a top is provided, and vice versa. \nThis solution should be extendable and scalable to build as a B2B product. Detailed input formats and technical \nexpectations will be shared at the commencement of the contract. The Freelancer is expected to align the \nsolution with these requirements and must be open to incorporating reasonable changes based on feedback \nduring the contract period. \n2. Duration of Engagement \nThe term of this engagement shall be for a period of one month, commencing from May 23, 2025, and ending on \nJune 22, 2025. The term may be extended upon mutual agreement between both parties. \n3. Work Arrangement \n• \nThe Freelancer shall work remotely from India and will be available for scheduled virtual meetings as \nrequired by th",
    "chunk_index": 1,
    "page": 1,
    "label": "1"
  },
  {
    "doc_id": "Ajay CK _Virtual Try On Contract.pdf",
    "chunk_text": "all work remotely from India and will be available for scheduled virtual meetings as \nrequired by the Company. \n• \nAny on-site visits, if required, shall be discussed and mutually agreed upon. \n4. Compensation \n• \nThe Freelancer shall be paid INR 35,000 (Thirty Thousand Rupees) in total for services rendered. \n• \nPayments shall be released on completion of the milestone 1- 2D virtual Fitting , INR 15000 (Fifteen \nThousand Rupees) and milestone 2- 360-degree spin visualisation, INR 20000 (Twenty Thousand \nRupees), contingent upon the Freelancer completing all assigned deliverables in accordance with the \nmutually agreed timelines and quality standards \n \n",
    "chunk_index": 2,
    "page": 1,
    "label": "1"
  },
  {
    "doc_id": "Ajay CK _Virtual Try On Contract.pdf",
    "chunk_text": " \n \n \n \n• \nPayments shall be made via bank transfer to the Freelancer’s designated account. \n5. Timelines and Milestones \n• \nThe Freelancer and the Company shall define specific timelines and milestones for deliverables. \n• \nAny missed deliverables or failure to meet quality standards may result in an early termination of this \nAgreement at the Company's discretion. \n6. Confidentiality \n• \nThe Freelancer agrees to maintain the confidentiality of all proprietary information, materials, and \nbusiness strategies of the Company, both during and after the term of this Agreement. \n• \nThe Freelancer shall not disclose, share, or use any Confidential Information, including but not limited \nto:  \no \nBusiness strategies, product designs, or production details. \no \nAny software, code, documentation, technical specifications, branding materials, or marketing \nplans. \no \nAny proprietary data, trade secrets, or know-how. \n• \nConfidentiality obligations shall survive for Two (2) years post-terminatio",
    "chunk_index": 3,
    "page": 2,
    "label": "2"
  },
  {
    "doc_id": "Ajay CK _Virtual Try On Contract.pdf",
    "chunk_text": "ecrets, or know-how. \n• \nConfidentiality obligations shall survive for Two (2) years post-termination of this Agreement. \n7. Intellectual Property Rights \n• \nAll designs, patterns, branding materials, and creative assets produced under this Agreement shall \nbe the exclusive property of the Company. \n• \nThe Freelancer waives any rights to claim ownership of such materials. \n8. Termination \n• \nEither party may terminate this Agreement with a 15-day prior written notice. \n• \nIn the event of termination, the Freelancer shall be compensated for the work completed up to the \ntermination date. \n• \nFailure to meet agreed timelines, milestones, or substandard quality of work may result in early \ntermination at the Company's discretion. \n9. Dispute Resolution \n• \nAny disputes arising under this Agreement shall be resolved through mutual discussion. \n• \nIf unresolved, the dispute shall be subject to arbitration under the laws of India. \n10. Governing Law \n• \nThis Agreement shall be governed by an",
    "chunk_index": 4,
    "page": 2,
    "label": "2"
  },
  {
    "doc_id": "Ajay CK _Virtual Try On Contract.pdf",
    "chunk_text": "o arbitration under the laws of India. \n10. Governing Law \n• \nThis Agreement shall be governed by and construed in accordance with the laws of India. \n \n \n",
    "chunk_index": 5,
    "page": 2,
    "label": "2"
  },
  {
    "doc_id": "Ajay CK _Virtual Try On Contract.pdf",
    "chunk_text": " \n \n \n \n• \nAny legal disputes shall be subject to the jurisdiction of the courts in Trivandrum, Kerala. \n11. Entire Agreement \nThis Agreement constitutes the entire understanding between the parties and supersedes all prior discussions, \nagreements, or understandings of any kind. \n \nIN WITNESS WHEREOF, the parties hereto have executed this Agreement as of the date first written above. \nFor Swakriti Lifestyle Private Limited \n \n \n \n \nFor Ajay Ck \n \n \n \n \n \n \n \n \n  \n \n \n \nAuthorized Signatory   \n \n \n \n \n \n \n Freelancer Signature \n \nName: Amala Mery Shyjy \n \n \n \n \n \n               Name: _____________________  \nDesignation: Co-Founder & Director  \n \n \n                                                                                                                          \nDate: 22/05/2025 \n \n \n \n \n \n                                Date: ______________________ \n \n \n \n",
    "chunk_index": 6,
    "page": 3,
    "label": "3"
  }
]